Added Bloodsport debate mode. This will aid in studying adversarial debates full of logical fallacies.
